{
    "name": "Instance Table",
    "namespace": "MCRI\\InstanceTable",
    "authors": [
        {
            "name": "Luke Stevens",
            "email": "luke.stevens@mcri.edu.au",
            "institution": "Murdoch Children's Research Institute"
        }
    ],
    "description": "Use the action tag <code>@INSTANCETABLE=form_name</code> in a descriptive text field to include a table showing data from repeat instances of that form.<br>If project is longitudinal, use <code>@INSTANCETABLE=event_name:form_name</code> to specify the event and form (can be a repeating form or a form in a repeating event).<br>Other action tags are available for controlling certain properties of the tables and their contents.",
    "framework-version": 15,
    "auth-ajax-actions": [ "get-data" ],
    "action-tags": [
        {
            "tag": "@INSTANCETABLE",
            "description": "Tag <code>@INSTANCETABLE=form_name</code> in a descriptive text field to include a table showing data from repeat instances of that form."
        },
        {
            "tag": "@INSTANCETABLE-HIDE",
            "description": "Ignore this field in instance all tables."
        },
        {
            "tag": "@INSTANCETABLE-LABEL",
            "description": "Tag @INSTANCETABLE-LABEL='column header': Provide an alternative column title for the field in all instance tables."
        },
        {
            "tag": "@INSTANCETABLE-HIDEADD",
            "description": "Suppress the \"+ Add New\" button on data entry forms."
        },
        {
            "tag": "@INSTANCETABLE-HIDEINSTANCECOL",
            "description": "Hide the '#' column containing instance numbers."
        },
        {
            "tag": "@INSTANCETABLE-VARLIST",
            "description": "Use, for example, <code>@INSTANCETABLE-VARLIST=rptfrmvar3,rptfrmvar1,rptfrmvar6,rptfrm_complete</code> to include only the variables from the repeating form that appear in the comma-separated list. Also sets the order of columns in the table rather (default is the order of fields from the form)."
        },
        {
            "tag": "@INSTANCETABLE-PAGESIZE",
            "description": "Override default choices for page sizing: specify integer default page size, or -1 for 'All'"
        },
        {
            "tag": "@INSTANCETABLE-SCROLLX",
            "description": "Default behaviour is for a wide table to cause its container to grow. Use this tag to get a horizontal scroll-bar instead."
        },
        {
            "tag": "@INSTANCETABLE-REF",
            "description": "Where you have an instance table on a repeating form that is referencing another repeating form, use <code>@INSTANCETABLE-REF=fieldname</code> to have the instances filtered to show only those where the current instance number is saved in a field on the referenced repeating form. For example, an instance table in a repeating 'Visit' form may be configured to show only instances of the repeating 'Medication' form where the current Visit instance is selected in the visitref field on the Medication form: <code>@INSTANCETABLE @INSTANCETABLE-REF=visitref</code>."
        },
        {
            "tag": "@INSTANCETABLE-FILTER",
            "description": "Use <code>@INSTANCETABLE-FILTER='[v]=1'</code> to specify a logic expression to show only instances that match the filter expression."
        },
        {
            "tag": "@INSTANCETABLE-ADDBTNLABEL",
            "description": "Use <code>@INSTANCETABLE-ADDBTNLABEL='Button Label'</code> to specify an alternative label for the \"Add New Instance\" button (\"New Medication\", \"Add new instance\" etc.)."
        },
        {
            "tag": "@INSTANCETABLE-HIDECHOICEVALUES",
            "description": "Use <code>@INSTANCETABLE-HIDECHOICEVALUES</code> to suppress the display of choice field values and show only choice labels."
        },
        {
            "tag": "@INSTANCETABLE-HIDEFORMSTATUS",
            "description": "Use <code>@INSTANCETABLE-HIDEFORMSTATUS</code> to suppress the display of the form status field in data entry view. (The form status field is always suppressed in survey mode.)"
        },
        {
            "tag": "@INSTANCETABLE-HIDEFORMINMENU",
            "description": "Use <code>@INSTANCETABLE-HIDEFORMINMENU</code> to hide the link to the repeating form in the Data Collection section of the project page menu."
        },
        {
            "tag": "@INSTANCETABLE-SORTCOL",
            "description": "Use <code>@INSTANCETABLE-SORTCOL=n:direction</code> to specify the column index for the default table sort. The index number should be a positive integer, with <code>1</code> being the first column (usually the instance number). Direction is optional and can be <code>asc</code> (default) or <code>desc</code> (case-insensitive) for ascending or descending respectively. The default sort in the absence of this tag is on the first column in ascending order, i.e. <code>@INSTANCETABLE-SORTCOL=1:asc]</code>"
        },
        {
            "tag": "@INSTANCETABLE-PREFILL",
            "description": "Use <code>@INSTANCETABLE-PREFILL='repeatingformfield=value'</code> to have fields on new instances pre-filled with the specified value using `fieldname=value` pairs in the URL in a manner similar to survey form field pre-filling. Notes: <ol><li>If the tag parameter contains piping expressions then values will be piped live - the form containing the instance table need not be saved.</li><li>Multiple fields can be pre-filled either by specifying multiple <code>@INSTANCETABLE-PREFILL</code> tags or by specifying a query string-form argument, e.g. <code>@INSTANCETABLE-PREFILL='v1=1&v2=2'</code>.</li><li>The data entry form field pre-filling capability is not limited to fields referenced in the tag, but is enabled for <em>all fields and forms project-wide</em>.</li></ol>"
        }
    ],
    "system-settings": [ ],
    "project-settings": [
        {
            "key": "allow-prefill",
            "name": "Allow pre-filling of fields via URL parameters in data entry mode (as for surveys):<br><p class=\"text-muted\">Add <code>&varname=value</code> to data entry form URLs to have field <code>varname</code> get the default value <code>value</code>.<br>Note: this is like using a <code>@DEFAULT</code> action tag on the field: it will work for unsaved forms only.</span>",
            "type": "checkbox"
        }
    ]
}
